In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

## 1- Confirm ETL was correct

In [3]:
%sql SELECT COUNT(*) FROM songplays

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(532,)]

In [4]:
%sql SELECT COUNT(*) FROM users

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(96,)]

In [5]:
%sql SELECT COUNT(*) FROM songs

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(71,)]

In [6]:
%sql SELECT COUNT(*) FROM artists

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [7]:
%sql SELECT COUNT(*) FROM time

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6813,)]

In [4]:
%sql SELECT * FROM songplays WHERE song_id IS NOT null;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(483, 1542837407796, 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

# 2- Additional quereis
Here we run some analaysis queries as examples.

Let us information about the users with most count of song plays. 
For this we need two steps, first to query the fact table to find the user-ids with the most numers of songplays, and then we have to query the dimensions tables such as the users table.

In [5]:
%sql SELECT count(*) as c, user_id FROM songplays Group By user_id ORDER BY c DESC limit 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(130, 49), (87, 16), (53, 24), (44, 80), (40, 82)]

In [6]:
%sql Select * from users where user_id in (Select user_id from (SELECT count(*) as c, user_id FROM songplays Group By user_id ORDER BY c DESC limit 5) as b);

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(80, 'Tegan', 'Levine', 'F', 'paid'),
 (16, 'Rylan', 'George', 'M', 'paid'),
 (49, 'Chloe', 'Cuevas', 'F', 'paid'),
 (82, 'Avery', 'Martinez', 'F', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid')]

Running the previous query. We can find that users with the most number of songplays are paid and are mostly females.

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).